hi_input = ''
do_input = ''
rest_input = ''
bye_input = ''  # Oголосили змінні

while True:  # Використовуємо «while» для циклу. Задаємо умови
    if hi_input == '':  # Умова, якщо до “input” присвоюється пуста строка.
        hi_input = input('').lower()  # Користувач вводить строку
        if hi_input == 'хай' or hi_input =='доброго дня':  # Умова, за якої бот надасть корректну відповідь.
            print('Доброго вечора, я бот з України!')  # Відповідь бота, якщо умова виконується.
        else:
            print('Привітайся зі мною')  # Бот відповідає, якщо не розуміє введений текст.
            hi_input = ''  # Нове віконце для користувача, щоб написати боту корректно.

    elif do_input == '':  # Умова, якщо до “input” присвоюється пуста строка.
        do_input = input('').lower()  # Користувач вводить строку
        if do_input == 'як справи?' or do_input == 'що робиш?' or do_input == 'чим займаєшся?':  # Умова, за якої бот надасть корректну відповідь.
            print('Вчусь програмувати на Python!')  # Відповідь бота, якщо умова виконується.
        else:
            print('Дізнайся, що я роблю:)')  # Бот відповідає, якщо не розуміє введений текст.
            do_input = ''  # Нове віконце для користувача, щоб написати боту корректно.

    elif rest_input == '':  # Умова, якщо до “input” присвоюється пуста строка.
        rest_input = input('').lower()  # Користувач вводить строку
        if 'о, а я дивлюсь фільм "код да вінчі". може ти можеш щось відрекомендувати мені?' in rest_input or 'а я пішов до кінотеатру на новий фільм жахів. може ти можеш щось відрекомендувати мені?' in rest_input:
            # Умова, за якої бот надасть корректну відповідь.
            print('Я звісно всього-навсього бездушна машина та не можу наполягати, але подивись серіал «Постукай у мої двері», Серкан Болат там просто  чарівний!')
            # Відповідь бота, якщо умова виконується.
        else:
            print('Скажи мені, що ти робиш, якщо це не секрет)')  # Бот відповідає, якщо не розуміє введений текст.
            # Відповідь бота, якщо умова виконується.
            rest_input = ''  # Нове віконце для користувача, щоб написати боту корректно.

    elif bye_input == '':  # Умова, якщо до “input” присвоюється пуста строка.
        bye_input = input('').lower()  # Користувач вводить строку
        if 'дуже дякую за рекомендацію, обов‘язково подивлюсь! бувай, друже!' in bye_input or 'дуже дякую за рекомендацію, обов‘язково подивлюсь! Надобраніч!' in bye_input:
            # Умова, за якої бот надасть корректну відповідь.
            print('Побачимось у мережі. Зовсім скоро я довчуся і захоплю світ! I‘ll be back. ')
            # Відповідь бота, якщо умова виконується.
            break  # Завершили виконання програми.
        else:
            print('Може попрощаєшся з новим другом?) ')  # Бот відповідає, якщо не розуміє введений текст.
            bye_input = ''  # Нове віконце для користувача, щоб написати боту корректно.




