hi_input = input('')                                       #Користувач вводить строку
while hi_input != 'Привіт' and hi_input != 'Хай' and hi_input != 'Доброго дня':      #Використовуємо «while» для циклу. Задаємо умови
    print('Привітайся зі мною')                            #Бот відповідає, якщо не розуміє введений текст
    hi_input = input('')                                   #Нове віконце для користувача, щоб написати боту корректно

print('Доброго вечора, я бот з України!')

do_input = input('')                                        #Користувач вводить строку
while do_input != 'Як справи?' and do_input != 'Що робиш?' and do_input != 'Чим займаєшся?':     #Використовуємо «while» для циклу. Задаємо умови
    print('Дізнайся, що я роблю:)')                         #Бот відповідає, якщо не розуміє введений текст
    do_input = input('')

print('Вчусь програмувати на Python!')

rest_input = input('')                                        #Користувач вводить строку
while rest_input != 'О, а я дивлюсь фільм "Код да Вінчі". Може ти можеш щось відрекомендувати мені?' and rest_input != 'А я пішов до кінотеатру на новий фільм жахів. Може ти можеш щось відрекомендувати мені?' and rest_input != 'А я дивлюсь серіал «Гра Престолів». Може ти можеш щось відрекомендувати мені?':        #Використовуємо «while» для циклу. Задаємо умови
    print('Скажи мені, що ти робиш, якщо це не секрет)')      #Бот відповідає, якщо не розуміє введений текст
    rest_input = input('')

print('Я звісно всього-навсього бездушна машина та не можу наполягати, але подивись серіал «Постукай у мої двері», Серкан Болат там просто  чарівний!')

bye_input = input('')                                     #Користувач вводить строку
while bye_input != 'Дуже дякую за рекомендацію, обов‘язково подивлюсь! Бувай, друже!' and bye_input != 'Дуже дякую за рекомендацію, обов‘язково подивлюсь! Надобраніч!' and bye_input != 'Дуже дякую за рекомендацію, обов‘язково подивлюсь! До зустрічі!':        #Використовуємо «while» для циклу. Задаємо умови
    print('Може попрощаєшся з новим другом?) ')           #Бот відповідає, якщо не розуміє введений текст
    bye_input = input('')

print('Побачимось у мережі. Зовсім скоро я довчуся і захоплю світ! I‘ll be back. ')         #Наше примітивне бото-спілкування попрощався та завершив виконання програми


