while True:
    hi_input = input('').lower()  # Користувач вводить строку
    if 'хай' in hi_input or 'доброго дня' in hi_input:
        print('Доброго вечора, я бот з України!')
        do_input = input('').lower()  # Користувач вводить строку
        if 'як справи?' in do_input or 'що робиш?' in do_input:
            print('Вчусь програмувати на Python!')
            rest_input = input('').lower()  # Користувач вводить строку
            if 'о, а я дивлюсь фільм "код да вінчі". може ти можеш щось відрекомендувати мені?' in rest_input:
                print('Я звісно всього-навсього бездушна машина та не можу наполягати, але подивись серіал «Постукай у мої двері», Серкан Болат там просто  чарівний!')
                bye_input = input('').lower()
                if 'дуже дякую за рекомендацію, обов‘язково подивлюсь! бувай, друже!' in bye_input or 'дуже дякую за рекомендацію, обов‘язково подивлюсь! Надобраніч!' in bye_input:
                    print('Побачимось у мережі. Зовсім скоро я довчуся і захоплю світ! I‘ll be back. ')
                    break


    else:
        print('На жаль, я не розумію вашого запиту. Можливо, ви можете пояснити більш детально?')
        continue

